Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/arb.h
/** \brief ARB register offsets definitions */
#define ARB_BT_CTRL_REG_OFST           _UINT32_(0x00)      /* (ARB_BT_CTRL)  Offset */
#define ARB_ZB_CTRL_REG_OFST           _UINT32_(0x04)      /* (ARB_ZB_CTRL)  Offset */
#define ARB_EVENT_CTRL_REG_OFST        _UINT32_(0x08)      /* (ARB_EVENT_CTRL)  Offset */
#define ARB_CORE_CTRL_REG_OFST         _UINT32_(0x0C)      /* (ARB_CORE_CTRL)  Offset */
#define ARB_CORE_STATUS_REG_OFST       _UINT32_(0x10)      /* (ARB_CORE_STATUS)  Offset */
#define ARB_INT_STATUS_REG_OFST        _UINT32_(0x14)      /* (ARB_INT_STATUS)  Offset */
#define ARB_INT_MASK_REG_OFST          _UINT32_(0x18)      /* (ARB_INT_MASK)  Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief ARB register API structure */
typedef struct
{  /*  */
  __IO  uint32_t                       ARB_BT_CTRL;        /**< Offset: 0x00 (R/W  32)  */
  __IO  uint32_t                       ARB_ZB_CTRL;        /**< Offset: 0x04 (R/W  32)  */
  __IO  uint32_t                       ARB_EVENT_CTRL;     /**< Offset: 0x08 (R/W  32)  */
  __IO  uint32_t                       ARB_CORE_CTRL;      /**< Offset: 0x0C (R/W  32)  */
  __I   uint32_t                       ARB_CORE_STATUS;    /**< Offset: 0x10 (R/   32)  */
  __I   uint32_t                       ARB_INT_STATUS;     /**< Offset: 0x14 (R/   32)  */
  __IO  uint32_t                       ARB_INT_MASK;       /**< Offset: 0x18 (R/W  32)  */
} arb_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _WBZ65_ARB_COMPONENT_H_ */
